// import React from 'react'

// function About() {
//   return (
//     <div style={{ backgroundColor: 'lightblue' ,textAlign:"center"}}>
//       <h2>ברוכים הבאים לאתרנו!</h2><br/>
//       <p>אנחנו שמחים שבחרתם לבקר באתר שלנו. אתר זה נועד במיוחד לשימוש הקהילה המקומית שלנו, ומטרתו לחסוך זמן ולספק שירותים חשובים לגבאים ולמתפללים.
//       </p><br/>
//       <p>
// באמצעות האתר שלנו, תוכלו לקבל מידע עדכני ולבצע פעולות שונות בקלות ובנוחות. תוכלו לראות את זמני התפילה המדויקים במקום שאתם נמצאים, ולתכנן את זמני התפילה שלכם בהתאם. זה מאפשר לכם להתאים את התפילה לסידורי העבודה והלוחות הזמנים האישיים שלכם.
//       </p><br/>
//       <br/>
//       <p>  
// בנוסף, האתר מציע גם אפשרויות נוספות לתמיכה בקהילה. תוכלו לתרום בקלות ובנוחות לבית הכנסת דרך האתר ולתמוך בפעילות הקהילתית. כמו כן, ניתן להשאיר הודעות ובקשות מיוחדות לגבאים, כגון בקשה לתפילה מיוחדת או סידור פטירה לשבת מסוימת. כל ההודעות מתקבלות ומעובדות בצורה מסודרת ונוחה עבור הגבאים.
//       </p>
    
//   </div>)
// }

// export default About

import React from 'react';
import './About.css';

function About() {
  return (
    <div className="about-container">
      <h2 className="about-title">ברוכים הבאים לאתרנו!</h2>
      <p className="about-paragraph">
        אנחנו שמחים שבחרתם לבקר באתר שלנו. אתר זה נועד במיוחד לשימוש הקהילה המקומית שלנו, ומטרתו לחסוך זמן ולספק שירותים חשובים לגבאים ולמתפללים.
      </p>
      <hr className="about-divider" />
      <p className="about-paragraph">
        באמצעות האתר שלנו, תוכלו לקבל מידע עדכני ולבצע פעולות שונות בקלות ובנוחות. תוכלו לראות את זמני התפילה המדויקים במקום שאתם נמצאים, ולתכנן את זמני התפילה שלכם בהתאם. זה מאפשר לכם להתאים את התפילה לסידורי העבודה והלוחות הזמנים האישיים שלכם.
      </p>
      <hr className="about-divider" />
      <p className="about-paragraph">
        בנוסף, האתר מציע גם אפשרויות נוספות לתמיכה בקהילה. תוכלו לתרום בקלות ובנוחות לבית הכנסת דרך האתר ולתמוך בפעילות הקהילתית. כמו כן, ניתן להשאיר הודעות ובקשות מיוחדות לגבאים, כגון בקשה לתפילה מיוחדת או סידור פטירה לשבת מסוימת. כל ההודעות מתקבלות ומעובדות בצורה מסודרת ונוחה עבור הגבאים.
      </p>
    </div>
  );
}

export default About;
